# 处理丢失数据

有两种丢失数据：
- None
- np.nan(NaN)

## 1. None

None是Python自带的，其类型为python object。因此，None不能参与到任何计算中。

object类型的运算要比int类型的运算慢得多  
计算不同数据类型求和时间  
%timeit np.arange(1e5,dtype=xxx).sum()

## 2. np.nan（NaN）

np.nan是浮点类型，能参与到计算中。但计算的结果总是NaN。

但可以使用np.nan*()函数来计算nan，此时视nan为0。

## 3. pandas中的None与NaN

### 1) pandas中None与np.nan都视作np.nan

创建DataFrame

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
df1 = DataFrame(data=np.random.randint(0,100,size=(3,3)),columns=list('ABC'))
display(df1)

    A   B   C
0  31  12  81
1   6  75  33
2  38  97  94

In [3]:
df1.loc[0,'B'] = None
df1

    A     B   C
0  31   NaN  81
1   6  75.0  33
2  38  97.0  94

In [4]:
df1['C'] = np.nan
df1

    A     B   C
0  31   NaN NaN
1   6  75.0 NaN
2  38  97.0 NaN

In [5]:
df1.loc[0,'B']

nan

使用DataFrame行索引与列索引修改DataFrame数据

### 2) pandas中None与np.nan的操作

- ``isnull()``
- ``notnull()``
- ``dropna()``: 过滤丢失数据
- ``fillna()``: 填充丢失数据

(1)判断函数
- ``isnull()``
- ``notnull()``

In [6]:
df1

    A     B   C
0  31   NaN NaN
1   6  75.0 NaN
2  38  97.0 NaN

In [7]:
df1.isnull()

       A      B     C
0  False   True  True
1  False  False  True
2  False  False  True

In [8]:
df1.notnull()

      A      B      C
0  True  False  False
1  True   True  False
2  True   True  False

(2) 过滤函数
- ``dropna()``

In [9]:
# 新增一行、一列
df1.loc[3] = [12,15,18]
df1

    A     B     C
0  31   NaN   NaN
1   6  75.0   NaN
2  38  97.0   NaN
3  12  15.0  18.0

In [10]:
# 默认是过滤所有有缺失值的行
df1.dropna()

    A     B     C
3  12  15.0  18.0

In [11]:
# 使用axis控制轴向变化
df1.dropna(axis=1)

    A
0  31
1   6
2  38
3  12

In [12]:
df1.loc[3,'C'] = np.nan

In [15]:
df1.dropna?

Signature: df1.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
Docstring:
Remove missing values.

See the :ref:`User Guide <missing_data>` for more on which values are
considered missing, and how to work with missing data.

Parameters
----------
axis : {0 or 'index', 1 or 'columns'}, default 0
    Determine if rows or columns which contain missing values are
    removed.

    * 0, or 'index' : Drop rows which contain missing values.
    * 1, or 'columns' : Drop columns which contain missing value.

    .. deprecated:: 0.23.0: Pass tuple or list to drop on multiple
    axes.
how : {'any', 'all'}, default 'any'
    Determine if row or column is removed from DataFrame, when we have
    at least one NA or all NA.

    * 'any' : If any NA values are present, drop that row or column.
    * 'all' : If all values are NA, drop that row or column.
thresh : int, optional
    Require that many non-NA values.
subset : array-like, optional
    Labels along other axis to consider, e.g. if you are dropping rows
    these would be a list of columns to include.
inplace : bool, default False
    If True, do operation inplace and return None.

Returns
-------
DataFrame
    DataFrame with NA entries dropped from it.

See Also
--------
DataFrame.isna: Indicate missing values.
DataFrame.notna : Indicate existing (non-missing) values.
DataFrame.fillna : Replace missing values.
Series.dropna : Drop missing values.
Index.dropna : Drop missing indices.

Examples
--------
>>> df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
...                    "toy": [np.nan, 'Batmobile', 'Bullwhip'],
...                    "born": [pd.NaT, pd.Timestamp("1940-04-25"),
...                             pd.NaT]})
>>> df
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Drop the rows where at least one element is missing.

>>> df.dropna()
     name        toy       born
1  Batman  Batmobile 1940-04-25

Drop the columns where at least one element is missing.

>>> df.dropna(axis='columns')
       name
0    Alfred
1    Batman
2  Catwoman

Drop the rows where all elements are missing.

>>> df.dropna(how='all')
       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Keep only the rows with at least 2 non-NA values.

>>> df.dropna(thresh=2)
       name        toy       born
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

Define in which columns to look for missing values.

>>> df.dropna(subset=['name', 'born'])
       name        toy       born
1    Batman  Batmobile 1940-04-25

Keep the DataFrame with valid entries in the same variable.

>>> df.dropna(inplace=True)
>>> df
     name        toy       born
1  Batman  Batmobile 1940-04-25
File:      d:\software\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [16]:
# inplace默认为False,设置为True,表示修改原始数据结构
df1.dropna(axis=1,how='all',inplace=True)

In [17]:
df1

    A     B
0  31   NaN
1   6  75.0
2  38  97.0
3  12  15.0

可以选择过滤的是行还是列（默认为行）

也可以选择过滤的方式 how = 'all'

(3) 填充函数 Series/DataFrame
- ``fillna()``

In [18]:
df1

    A     B
0  31   NaN
1   6  75.0
2  38  97.0
3  12  15.0

In [19]:
# value参数默认是把所有空值用指定值填充
df1.fillna(value=100)

    A      B
0  31  100.0
1   6   75.0
2  38   97.0
3  12   15.0

In [20]:
df1

    A     B
0  31   NaN
1   6  75.0
2  38  97.0
3  12  15.0

In [22]:
df1.fillna?

Signature: df1.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None, **kwargs)
Docstring:
Fill NA/NaN values using the specified method

Parameters
----------
value : scalar, dict, Series, or DataFrame
    Value to use to fill holes (e.g. 0), alternately a
    dict/Series/DataFrame of values specifying which value to use for
    each index (for a Series) or column (for a DataFrame). (values not
    in the dict/Series/DataFrame will not be filled). This value cannot
    be a list.
method : {'backfill', 'bfill', 'pad', 'ffill', None}, default None
    Method to use for filling holes in reindexed Series
    pad / ffill: propagate last valid observation forward to next valid
    backfill / bfill: use NEXT valid observation to fill gap
axis : {0 or 'index', 1 or 'columns'}
inplace : boolean, default False
    If True, fill in place. Note: this will modify any
    other views on this object, (e.g. a no-copy slice for a column in a
    DataFrame).
limit : int, default None
    If method is specified, this is the maximum number of consecutive
    NaN values to forward/backward fill. In other words, if there is
    a gap with more than this number of consecutive NaNs, it will only
    be partially filled. If method is not specified, this is the
    maximum number of entries along the entire axis where NaNs will be
    filled. Must be greater than 0 if not None.
downcast : dict, default is None
    a dict of item->dtype of what to downcast if possible,
    or the string 'infer' which will try to downcast to an appropriate
    equal type (e.g. float64 to int64 if possible)

See Also
--------
interpolate : Fill NaN values using interpolation.
reindex, asfreq

Returns
-------
filled : DataFrame

Examples
--------
>>> df = pd.DataFrame([[np.nan, 2, np.nan, 0],
...                    [3, 4, np.nan, 1],
...                    [np.nan, np.nan, np.nan, 5],
...                    [np.nan, 3, np.nan, 4]],
...                    columns=list('ABCD'))
>>> df
     A    B   C  D
0  NaN  2.0 NaN  0
1  3.0  4.0 NaN  1
2  NaN  NaN NaN  5
3  NaN  3.0 NaN  4

Replace all NaN elements with 0s.

>>> df.fillna(0)
    A   B   C   D
0   0.0 2.0 0.0 0
1   3.0 4.0 0.0 1
2   0.0 0.0 0.0 5
3   0.0 3.0 0.0 4

We can also propagate non-null values forward or backward.

>>> df.fillna(method='ffill')
    A   B   C   D
0   NaN 2.0 NaN 0
1   3.0 4.0 NaN 1
2   3.0 4.0 NaN 5
3   3.0 3.0 NaN 4

Replace all NaN elements in column 'A', 'B', 'C', and 'D', with 0, 1,
2, and 3 respectively.

>>> values = {'A': 0, 'B': 1, 'C': 2, 'D': 3}
>>> df.fillna(value=values)
    A   B   C   D
0   0.0 2.0 2.0 0
1   3.0 4.0 2.0 1
2   0.0 1.0 2.0 5
3   0.0 3.0 2.0 4

Only replace the first NaN element.

>>> df.fillna(value=values, limit=1)
    A   B   C   D
0   0.0 2.0 2.0 0
1   3.0 4.0 NaN 1
2   NaN 1.0 NaN 5
3   NaN 3.0 NaN 4
File:      d:\software\anaconda3\lib\site-packages\pandas\core\frame.py
Type:      method

In [24]:
df1.fillna(method='ffill',limit=1,axis=1)

      A     B
0  31.0  31.0
1   6.0  75.0
2  38.0  97.0
3  12.0  15.0

可以选择前向填充还是后向填充

对于DataFrame来说，还要选择填充的轴axis。记住，对于DataFrame来说：

- axis=0：index/行
- axis=1：columns/列

============================================

练习7：

1. 简述None与NaN的区别

2. 假设张三李四参加模拟考试，但张三因为突然想明白人生放弃了英语考试，因此记为None，请据此创建一个DataFrame,命名为ddd3

3. 老师决定根据用数学的分数填充张三的英语成绩，如何实现？
    用李四的英语成绩填充张三的英语成绩？

============================================

In [25]:
data = np.random.randint(0,100,size=(3,3))
columns = ['语文','数学','英语']
index = ['张三','李四','王二小']
score = DataFrame(data=data, index=index,columns=columns)
score

     语文  数学  英语
张三   68  97  89
李四   49   6  73
王二小  51  38   0

In [26]:
score.loc['张三','英语'] = np.nan

In [27]:
score

     语文  数学    英语
张三   68  97   NaN
李四   49   6  73.0
王二小  51  38   0.0

In [28]:
score.fillna(method='ffill',axis=1)

       语文    数学    英语
张三   68.0  97.0  97.0
李四   49.0   6.0  73.0
王二小  51.0  38.0   0.0

In [29]:
score.fillna(method='bfill',axis=0)

     语文  数学    英语
张三   68  97  73.0
李四   49   6  73.0
王二小  51  38   0.0